Tekla.Structures.Model.RebarSpacing.SpacingType
Defines the different spacing types.

Tekla.Structures.Model.RebarSpacing.SpacingType.UNDEFINED
Undefined spacing.

Tekla.Structures.Model.RebarSpacing.SpacingType.EXACT_SPACINGS
Explicitly defined exact spacings.

Tekla.Structures.Model.RebarSpacing.SpacingType.NUMBER_BARS
Spacing by number of bars.

Tekla.Structures.Model.RebarSpacing.SpacingType.TARGET
Spacing by target distance.

Tekla.Structures.Model.RebarSpacing.SpacingType.EXACT_FLEXIBLE_FIRST
Exact spacing with flexible first space.

Tekla.Structures.Model.RebarSpacing.SpacingType.EXACT_FLEXIBLE_LAST
Exact spacing with flexible last space.

Tekla.Structures.Model.RebarSpacing.SpacingType.EXACT_FLEXIBLE_FIRST_AND_LAST
Exact spacing with flexible first and last space.

Tekla.Structures.Model.RebarSpacing.SpacingType.EXACT_FLEXIBLE_MIDDLE
Exact spacing with flexible middle space.